# Data Frame

In [4]:
import pandas as pd

# A DataFrame represents a rectangular table of data and contains an ordered 
collection of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index

Data frames= series + series

# Methods to create dataframes

# -Dictionary  into list

-  in dict into list the keys of dictionary work as a be columns

In [6]:
df1={
    "Names" : ["Sadiq shah" , "Ali Baksh" , "Faizaan" , "Kahisf"] ,
    "Degree": ["BScs" , "10th" , "BScs" , "Bscs"],
    "COntact No" : [22435346,6867978,67869898,769877]
    
    
}
data_frame=pd.DataFrame(df1)   # creating Dictionary into dataframe by using  "DataFrame" key word...
data_frame    # printing data frame

# ---> Keys of the dictionary are the columns values...and list will be value of the columns

        Names Degree  COntact No
0  Sadiq shah   BScs    22435346
1   Ali Baksh   10th     6867978
2     Faizaan   BScs    67869898
3      Kahisf   Bscs      769877

In [8]:
#Books Example....
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [14]:
# Book Example
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Dictionary into Dictionary

In [14]:
df3={ "State" : {"City1" : "Karachi" ,"City2" : "Lahore" ,  "City3" : "Islamabad"},
      "Years" : {"Year1" :2012,"Year2" :2015,"Year3" :2018},
     "Province": {"Provinces1" :"Sindh" , "Province2" :"Panjaab" ,"Province3" : "Panjaab"}

}
df3=pd.DataFrame(df3)
df3

                State   Years Province
City1         Karachi     NaN      NaN
City2          Lahore     NaN      NaN
City3       Islamabad     NaN      NaN
Province2         NaN     NaN  Panjaab
Province3         NaN     NaN  Panjaab
Provinces1        NaN     NaN    Sindh
Year1             NaN  2012.0      NaN
Year2             NaN  2015.0      NaN
Year3             NaN  2018.0      NaN

In [4]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
data=pd.DataFrame(pop)
data

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [11]:
info={
       "Karachi" : {2018 : 24344554},
       "Queeta" : {2018 : 24344554,2020 : 244656744554},
        "Peshawar":{2018 : 24344554,2020 : 244656744554,2019 : 24366544554}
}

data=pd.DataFrame(info)
print(data)

         Karachi        Queeta      Peshawar
2018  24344554.0  2.434455e+07      24344554
2019         NaN           NaN   24366544554
2020         NaN  2.446567e+11  244656744554

# dict of Series

In [16]:
d_o_s={
    "Country" : [pd.Series(["Pak" , "India" , "England" , "Australlia"])],
    "Capital" : [pd.Series(["Islamabad" , "Bombaai" , "Washingtine","NewYOrk"])]
    
    
    
}
data=pd.DataFrame(d_o_s)
data

,Country,Capital
0,0 Pak 1 India 2 Englan...,0 Islamabad 1 Bombaai 2 Washing...

# Dict into Tuples

In [41]:
d_o_s={
    "Country" :("Pak" , "India" , "England" , "Australlia"),
    "Capital" :("Islamabad" , "Bombaai" , "Washingtine","NewYOrk")
    
    
    
}
data=pd.DataFrame(d_o_s)
data

      Country      Capital
0         Pak    Islamabad
1       India      Bombaai
2     England  Washingtine
3  Australlia      NewYOrk

# List of list

In [13]:
data=[["Kashif","Ali"],[34,22]]   # Nested list(one list contain more  lists) [    [  ]   , [   ].....n  ]
datas=pd.DataFrame(data,index=["Names","Age"])
datas

            0    1
Names  Kashif  Ali
Age        34   22

# list of dict

In [ ]:
List of dicts or Series Each item becomes a row in the DataFrame; union of dict keys or Series indexes become the
DataFrameâ€™s column labels

In [15]:
list_o_dict=[{"Name" : "Sadiq shah","age" : "23"},{"Name" : "Ali","age" : "22"}]
data=pd.DataFrame(list_o_dict)
data

         Name age
0  Sadiq shah  23
1         Ali  22